app/controllers/exercises_controller.rb

  def index
    @title = "Excercises"
    @exercises = Exercise.all
    @muscles = Muscle.all
---
SELECT "exercises".* FROM "exercises"
SELECT "muscles".* FROM "muscles"

  def show
    @exercise = Exercise.find(params[:id])
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]