app/views/exercises/index.html.haml

SELECT "exercises".* FROM "exercises" WHERE (("exercises"."muscle_type_1" = $1 OR "exercises"."muscle_type_2" = $2) OR "exercises"."muscle_type_3" = $3)  [["muscle_type_1", "Biceps"], ["muscle_type_2", "Biceps"], ["muscle_type_3", "Biceps"]]
---
    %tbody
    - exercise_list = Exercise.where(muscle_type_1: x.muscle_name).or(Exercise.where(muscle_type_2: x.muscle_name)).or(Exercise.where(muscle_type_3: x.muscle_name))